{
  "personajes": [
    [
      "info": {
        "cantidad": 24,
        "paginas": 2,
        "siguiente": "https://my-json-server.typicode.com/DiabloJM/myStarWarsAPI/personaje?pagina=2",
        "prev": null
      },
      "resultados": [
        {
          "id": 1,
          "nombre": "Luke Skywalker",
          "especie": "Humano",
          "genero": "Masculino",
          "altura": "1.72 m",
          "nacimiento": "19 ABY",
          "planeta": "https://my-json-server.typicode.com/DiabloJM/myStarWarsAPI/planetas/1",
          "imagen": "https://static.wikia.nocookie.net/esstarwars/images/d/d9/Luke-rotjpromo.jpg/revision/latest/scale-to-width-down/350?cb=20071214134433",
          "descripcion": "Fue un humano sensible a la Fuerza y un Maestro Jedi quien, junto a su hermana gemela, la Princesa Leia Organa, luchó en contra del gobierno del Imperio Galáctico durante la Guerra Civil Galáctica. Hijo del Caballero Jedi Anakin Skywalker y de la Senadora Padmé Amidala de Naboo, Luke nació poco después del final de la Guerras Clon el 19 ABY. Como resultado de la muerte de su madre y de la caída de su padre al lado oscuro de la Fuerza, Luke fue enviado al planeta natal de Anakin, Tatooine, para vivir con sus relativos, Owen y Beru Lars, durante los primeros 19 años de su vida. Después de sus muertes a manos del Imperio, Luke se convirtió en aprendiz del antiguo maestro de su padre, Obi-Wan Kenobi, con el fin de aprender los caminos de la Fuerza y convertirse en un Jedi. Con la ayuda de los contrabandistas Han Solo y Chewbacca, Skywalker rescato a Leia Organa de las garras del Imperio, pero perdió a su maestro, quien murió mientras confrontaba al Lord Sith Darth Vader. En la Batalla de Yavin, Skywalker logró destruir la estación de batalla y superarma del Imperio, la Estrella de la Muerte, salvando así a la Alianza para Restaurar la República de la destrucción"
        },
        {
          "id": 2,
          "nombre": "Leia Organa",
          "especie": "Humano",
          "genero": "Femenino",
          "altura": "1.55 m",
          "nacimiento": "19 ABY",
          "planeta": "https://my-json-server.typicode.com/DiabloJM/myStarWarsAPI/planetas/1",
          "imagen": "https://static.wikia.nocookie.net/esstarwars/images/9/9b/Princessleiaheadwithgun.jpg/revision/latest?cb=20150117214124",
          "descripcion": "Fue una política humana sensible a la Fuerza y una líder militar que sirvió en la Alianza para Restaurar la República durante la Era Imperial y en la Resistencia en la subsiguiente Era de la Nueva República. Adoptada en la Casa de Organa, la familia real alderaaniana, ella fue la Princesa Leia Organa de Alderaan, un planeta de los Mundos del Núcleo conocido por su dedicación al pacifismo. La princesa fue criada como la hija del Senador Bail Prestor Organa y su mujer, la Reina Breha Organa, lo que la convertía en la heredera de la monarquía alderaaniana. Inculcada con los valores de su mundo adoptivo, Organa dedicó su vida a la restauración de la democracia oponiéndose a regímenes autoritarios como el Imperio Galáctico y la Primera Orden"
        },
        {
          "id": 3,
          "nombre": "Han Solo",
          "especie": "Humano",
          "genero": "Masculino",
          "altura": "1.8 m",
          "nacimiento": "29 ABY",
          "planeta": "https://my-json-server.typicode.com/DiabloJM/myStarWarsAPI/planetas/2",
          "imagen": "https://static.wikia.nocookie.net/esstarwars/images/f/fe/Han_Solo%27s_blaster.jpg/revision/latest?cb=20151030182246",
          "descripcion": "Anteriormente conocido como Han antes de que un Oficial de Reclutamiento Imperial le diera el apellido Solo, era un hombre humano contrabandista que se convirtió en un líder en la Alianza para Restaurar la República y una figura instrumental en la derrota del Imperio Galáctico durante la Guerra Civil Galáctica. Él procedía de Corellia y se convirtió en un contrabandista al servicio de Jabba el Hutt, incluso completando el Corredor de Kessel en menos de trece parsecs con su preciada nave, el Halcón Milenario. Era el yerno del Caballero Jedi caído Anakin Skywalker y la Senadora Padmé Amidala, esposo de la Princesa Leia Organa, cuñado del Maestro Jedi Luke Skywalker, padre de Ben Solo, rivales y amigos cercanos de su contrabandista Lando Calrissian y mejores amigos de Chewbacca, su copiloto de confianza que juró una deuda de vida con el contrabandista corelliano. Solo entró en conflicto con Jabba después de deshacerse de un cargamento de especias para evitar problemas con el Imperio, lo que le debió al Hutt una gran cantidad de dinero como resultado. Su fortuna parecía haber cambiado cuando acordó contratar a Luke Skywalker, Obi-Wan Kenobi, y los droides R2-D2 y C-3PO a Alderaan, pero quedó atrapado en la rebelión contra el Imperio y, después de ayudar a escapar a Leia Organa de la Estrella de la Muerte, luchó brevemente en la Batalla de Yavin, lo que permitió a Skywalker destruir la superarma. Solo luchó con la Rebelión durante varios años después, participando en numerosas operaciones y batallas contra el Imperio."
        },
        {
          "id": 4,
          "nombre": "Chewbacca",
          "especie": "Wookiee",
          "genero": "Masculino",
          "altura": "2.3 m",
          "nacimiento": "200 ABY",
          "planeta": "https://my-json-server.typicode.com/DiabloJM/myStarWarsAPI/planetas/4",
          "imagen": "https://static.wikia.nocookie.net/esstarwars/images/5/51/Chewbacca_TLJ.PNG/revision/latest/scale-to-width-down/350?cb=20190419143715",
          "descripcion": "Llamado afectuosamente Chewie por sus amigos, fue un guerrero wookiee, un contrabandista y un luchador de resistencia que peleó en las Guerras Clon, la Guerra Civil Galáctica y el Guerra Fría. Fue criado en el planeta Kashyyyk y se convirtió en un líder militar. Durante las Guerras Clon, fue capturado por esclavistas trandoshanos y hecho prisionero en Wasskah, donde trabajó con otra cautiva, la Comandante Jedi Ahsoka Tano, para escapar. Más tarde comandó a las fuerzas wokiees durante la Batalla de Kashyyyk junto al Gran Ejército de la República, liderado por el Maestro Jedi Yoda. Durante la batalla, una de las últimas de la guerra, los soldados clon de Yoda recibieron la Orden 66 del Canciller Supremo Sheev Palpatine y, con la ayuda de Chewbacca, Yoda escapó de Kashyyyk y la destrucción de la Orden Jedi"
        },
        {
          "id": 5,
          "nombre": "Lando Calrissian",
          "especie": "Humano",
          "genero": "Masculino",
          "altura": "1.78 m",
          "nacimiento": "31 ABY",
          "planeta": "DESCONOCIDO",
          "imagen": "https://static.wikia.nocookie.net/esstarwars/images/7/7d/Lando_WoSW.jpg/revision/latest/scale-to-width-down/342?cb=20090602222228",
          "descripcion": "Fue un apostador profesional, empresario, contrabandista y general. Se convirtió en apostador y estafador en sus primeros años de vida, eventualmente ganando su propia nave, el Halcón Milenario, en un juego de sabacc a un hombre llamado Cix Trouvee. Tuvo muchas aventuras con el Halcón y su droide piloto, Vuffi Raa, y en ellas se enemistó con un Hechicero de Tund llamado Rokur Gepta, a quien Calrissian terminó dando muerte. Después de que una serie de sucesos resultaran en que perdiera el Halcón Milenario ante un corelliano llamado Han Solo en Bespin, Calrissian acabó convirtiéndose en Barón Administrador de la Ciudad de las Nubes por un tiempo—cargo que también adquirió jugando sabacc"
        },
        {
          "id": 6,
          "nombre": "Padme Amidala",
          "especie": "Humano",
          "genero": "Femenino",
          "altura": "1.65 m",
          "nacimiento": "46 ABY",
          "planeta": "https://my-json-server.typicode.com/DiabloJM/myStarWarsAPI/planetas/10",
          "imagen": "https://static.wikia.nocookie.net/esstarwars/images/b/b4/Padme_episodeIII_green.png/revision/latest/scale-to-width-down/344?cb=20120308181142",
          "descripcion": "Fue una humana política que se convirtió en una de las principales voces para la paz y la diplomacia durante los últimos días de la República Galáctica. Ella saltó a la prominencia galáctica cuando la Federación de Comercio invadió y ocupó su planeta natal de Naboo, pasó a servir como una destacada miembro del Senado Galáctico durante la Guerra de los Clones, y se convirtió en la madre de la legendaria Princesa y General Leia Organa y el Maestro Jedi Luke Skywalker"
        },
        {
          "id": 7,
          "nombre": "Anakin Skywalker",
          "especie": "Humano",
          "genero": "Masculino",
          "altura": "1.88 m",
          "nacimiento": "41 ABY",
          "planeta": "https://my-json-server.typicode.com/DiabloJM/myStarWarsAPI/planetas/9",
          "imagen": "https://static.wikia.nocookie.net/esstarwars/images/6/6f/Anakin_Skywalker_RotS.png/revision/latest/scale-to-width-down/350?cb=20160226204939",
          "descripcion": "Un hombre humano sensible a la Fuerza, fue un Caballero Jedi de la República Galáctica y el Elegido de la Fuerza. Durante las Guerras Clon, sus logros como comandante en el campo de batalla le valieron el apodo del Héroe Sin Miedo"
        },
        {
          "id": 8,
          "nombre": "Mace Windu",
          "especie": "Humano",
          "genero": "Masculino",
          "altura": "1.92 m",
          "nacimiento": "72 ABY",
          "planeta": "DESCONOCIDO",
          "imagen": "https://static.wikia.nocookie.net/esstarwars/images/f/fc/Mace_Windu.jpg/revision/latest/scale-to-width-down/350?cb=20150925220911",
          "descripcion": "Maestro Jedi humano y miembro del Alto Consejo Jedi durante los últimos días de la República Galáctica. Nacido en el planeta Haruun Kal, Windu fue entrenado en los caminos de la Fuerza debido a su fuerte conexión con ella. Al ascender al rango de Maestro, empezó a ser conocido como el campeón de la Orden Jedi, un honor que acarreó hasta años después de su muerte. En algún punto de su carrera, Windu pasó a servir como Maestro de la Orden, el líder electo de la Orden Jedi"
        },
        {
          "id": 9,
          "nombre": "Obi-Wan Kenobi",
          "especie": "Humano",
          "genero": "Masculino",
          "altura": "1.82 m",
          "nacimiento": "57 ABY",
          "planeta": "DESCONOCIDO",
          "imagen": "https://static.wikia.nocookie.net/cartoonnetwork/images/0/0e/Obi-Wan_Kenobi_imagen.jpg/revision/latest?cb=20151213033541&path-prefix=es",
          "descripcion": "Fue un legendario Maestro Jedi humano que sirvió en el Alto Consejo Jedi durante los últimos añosde la Era de la República. Como General Jedi, Kenobi sirvió en el Gran Ejército de la República durante las Guerras Clon. Kenobi, sin embargo, se vio obligado a exiliarse como resultado de la Gran Purga Jedi. Como mentor, Kenobi fue responsable del entrenamiento de dos miembros de la familia Skywalker, Anakin Skywalker y Luke Skywalker, sirviendo ambos como su Padawan para aprender los caminos de la Fuerza"
        },
        {
          "id": 10,
          "nombre": "General Gribous",
          "especie": "Kaleesh",
          "genero": "Masculino",
          "altura": "2.16 m",
          "nacimiento": "DESCONOCIDO",
          "planeta": "DESCONOCIDO",
          "imagen": "https://static.wikia.nocookie.net/esstarwars/images/d/de/Grievoushead.jpg/revision/latest/scale-to-width-down/350?cb=20101204131756",
          "descripcion": "Fue un señor de la guerra kaleesh que sirvió como oficial al mando en las fuerzas armadas de la Confederación de Sistemas Independientes durante los últimos años de la República Galáctica. Aunque era conocido por su rango de general, Grievous era el Comandante Supremo del Ejército Droide Separatista que hizo frente al Gran Ejército de la República a lo largo del conflicto pan-galáctico conocido como las Guerras Clon. Célebre por su crueldad y sus extensas mejoras cibernéticas, Grievous inspiraba miedo mientras viajaba por la galaxia, invadiendo mundos enteros y enfrentándose a los Caballeros Jedi de la República"
        },
        {
          "id": 11,
          "nombre": "C3PO",
          "especie": "Droide",
          "genero": "Masculino",
          "altura": "1.77 m",
          "nacimiento": "Antes del 32 ABY",
          "planeta": "https://my-json-server.typicode.com/DiabloJM/myStarWarsAPI/planetas/9",
          "imagen": "https://static.wikia.nocookie.net/esstarwars/images/3/3f/C-3PO_TLJ_Card_Trader_Award_Card.png/revision/latest/scale-to-width-down/243?cb=20200718062140",
          "descripcion": "Un droide de protocolo unidad 3PO diseñado para interactuar con seres orgánicos, programado principalmente para la etiqueta y el protocolo. Hablaba con fluidez más de siete millones de formas de comunicación, y desarrolló una personalidad exigente y propensa a las preocupaciones a lo largo de sus muchas décadas de operación. Junto con su contraparte, el droide astromecánico R2-D2, C-3PO constantemente se encontró involucrado directamente en momentos cruciales de la historia galáctica, y ayudó a salvar la galaxia en muchas ocasiones"
        },
        {
          "id": 12,
          "nombre": "R2-D2",
          "especie": "Droide",
          "genero": "Masculino",
          "altura": "1.08 m",
          "nacimiento": "DESCONOCIDO",
          "planeta": "https://my-json-server.typicode.com/DiabloJM/myStarWarsAPI/planetas/10",
          "imagen": "https://static.wikia.nocookie.net/esstarwars/images/e/eb/ArtooTFA2-Fathead.png/revision/latest/scale-to-width-down/337?cb=20150926172435",
          "descripcion": "Un droide astromecánico serie R2 manufacturado por Industrias Automaton con programación masculina. Un ingenioso y valiente droide, R2-D2 sirvió a una multitud de maestros a lo largo de su vida. R2 nunca recibió un borrado completo de memoria ni recibió programación nueva, lo que resultó en su actitud aventurera e independiente. A menudo viéndose implicado en momento vitales de la historia galáctica, su valentía e ingenio salvaron a la galaxia repetidas veces"
        }
      ],
      [
        "info": {
          "cantidad": 24,
          "paginas": 2,
          "siguiente": null,
          "prev": "https://my-json-server.typicode.com/DiabloJM/myStarWarsAPI/personaje?pagina=1"
        },
        "resultados": [
          {
            "id": 13,
            "nombre": "Yoda",
            "especie": "DESCONOCIDO",
            "genero": "Masculino",
            "altura": "0.66 m",
            "nacimiento": "896 ABY",
            "planeta": "DESCONOCIDO",
            "imagen": "https://static.wikia.nocookie.net/esstarwars/images/d/d6/Yoda_SWSB.png/revision/latest/scale-to-width-down/350?cb=20180105191224",
            "descripcion": "Era un reverenciado Maestro Jedi que sirvió como Gran Maestro de la Orden Jedi en los últimos días de la República Galáctica. Era famoso dentro de la Orden por su sabiduría, poderes de la Fuerza y combate con sables de luz, y vivió durante casi 900 años. Su tiempo durante los últimos días de la Orden Jedi y más allá lo convirtió en una figura consecuente en la historia galáctica"
        },
        {
            "id": 14
            "nombre": "Dooku"
            "especie": "Humano",
            "genero": "Masculino",
            "altura": "1.93 m",
            "nacimiento": "102 ABY",
            "planeta": "DESCONOCIDO",
            "imagen": "https://static.wikia.nocookie.net/esstarwars/images/b/b8/Dooku_Headshot.jpg/revision/latest/scale-to-width-down/350?cb=20200115140857",
            "descripcion": "Fue un Lord Sith que lideró la Confederación de Sistemas Independientes como Jefe de Estado durante las Guerras Clon. A pesar de que una vez fue un Maestro Jedi, Dooku dejó la Orden Jedi y la República Galáctica después de desilusionarse con la corrupción en el gobierno. Dando la espalda a la luz, Dooku se unió al lado oscuro de la Fuerza y se convirtió en el aprendiz de Darth Sidious, un Señor Oscuro de los Sith, tomando el nombre de Darth Tyranus y reclamando su título como el Conde de Serenno. Con su maestro, que era secretamente el Canciller Supremo Sheev Palpatine, Dooku conspiró para derrocar tanto a la República como a los Jedi para que los Sith pudieran reclamar su anterior dominio. Con este fin, supervisó un creciente movimiento Separatista que finalmente resultó en la formación de la Confederación de Sistemas Independientes. Además de reunir a cientos de sistemas estelares rebeldes para la causa Separatista, Dooku estuvo involucrado en la creación de los soldados clon del Gran Ejército de la República, suministrando a los kaminoanos una plantilla de clonación, Jango Fett, así como un biochip de modificación conductual que contenía el Protocolo Clon 66. Como resultado de las maquinaciones de Dooku y Sidious, la galaxia se vio envuelta en las Guerras Clon en el 22 ABY"
        },
        {
            "id": 15,
            "nombre": "Darth Sidious",
            "especie": "Humano",
            "genero": "Masculino",
            "altura": "1.73 m",
            "nacimiento": "84 ABY",
            "planeta": "https://my-json-server.typicode.com/DiabloJM/myStarWarsAPI/planetas/10",
            "imagen": "https://static.wikia.nocookie.net/esstarwars/images/9/98/Palpatine-TROS-infobox.jpg/revision/latest/scale-to-width-down/350?cb=20200423044005",
            "descripcion": "Nacido como Sheev Palpatine y también conocido simplemente como el Emperador, fue un hombre humano Señor Oscuro de los Sith y Emperador del Imperio Galáctico, que gobernó desde el 19 ABY hasta el 4 DBY. Ascendiendo al poder en el Senado de la República como senador de Naboo, el Lord Sith en secreto conservó dos identidades, Sidious y Palpatine, usando ambas para avanzar en su carrera política. Orquestando la caída de la República Galáctica y de la Orden Jedi a través de las Guerras Clon, y luego estableciendo su reinado sobre la galaxia que duró hasta su muerte en la Batalla de Endor. Sin embargo, el lado oscuro de la Fuerza dio lugar a poderes que permitieron al Emperador regresar de la tumba"
        },  
        {
            "id": 16,
            "nombre": "Rex",
            "especie": "Humano",
            "genero": "Masculino",
            "altura": "1.83 m",
            "nacimiento": "32 ABY",
            "planeta": "https://my-json-server.typicode.com/DiabloJM/myStarWarsAPI/planetas/5",
            "imagen": "https://static.wikia.nocookie.net/disney/images/3/3a/Captain_Rex_3.jpg/revision/latest?cb=20170322024507&path-prefix=es",
            "descripcion": "Su designación era CT-7567 fue un veterano Capitán Clon que dirigió la aclamada Legión 501 del Gran Ejército de la República durante las Guerras Clon. Rex sirvió más adelante como capitán y comandante en la Alianza para Restaurar la República durante la Guerra Civil Galáctica. Criado y entrenado en Kamino, CT-7567 entró al servicio de la República Galáctica en la Batalla de Geonosis, en el 22 ABY. 7567 se forjó la reputación de un honorable comandante ante Jedi y soldados clon por igual, llegando a ser conocido como uno de los mejores y más duros soldados del Gran Ejército de la República. Con el tiempo, tomó el apodo de Rex. Como capitán de la 501, Rex sirvió como segundo al mando del General Jedi Anakin Skywalker, cuya valentía y heterodoxia en batalla llegó a compartir. Rex fue muy amigo del Comandante Clon Mariscal Cody, cuya relación era un reflejo de la de sus respectivos Generales Jedi, Skywalker y Obi-Wan Kenobi. Los cuatro a menudo recibieron misiones conjuntas para coordinar sus campañas en primera línea contra la Confederación de Sistemas Independientes"
        },
        {
            "id": 17,
            "nombre": "Boba Fett",
            "especie": "Humano",
            "genero": "Masculino",
            "altura": "1.83 m",
            "nacimiento": "32 ABY",
            "planeta": "https://my-json-server.typicode.com/DiabloJM/myStarWarsAPI/planetas/5",
            "imagen": "https://i0.wp.com/imgs.hipertextual.com/wp-content/uploads/2021/11/1193126-scaled.jpg?fit=1200%2C675&quality=50&strip=all&ssl=1",
            "descripcion": "Fue un cazarrecompensas humano, y el clon del infame cazarrecompensas Jango Fett. Boba fue creado por los clonadores de Kamino y era físicamente idéntico a los soldados clon creados para el Gran Ejército de la República, aunque Boba fue inalterado y no creció aceleradamente como los demás clones. Criado como el hijo de Jango, Boba aprendió las habilidades de combate necesarias para algún día convertirse en cazarrecompensas por derecho propio"
        },
        {
            "id": 18,
            "nombre": "Darth Vader",
            "especie": "Humano",
            "genero": "Masculino",
            "altura": "2.03 m",
            "nacimiento": "19 ABY",
            "planeta": "https://my-json-server.typicode.com/DiabloJM/myStarWarsAPI/planetas/6",
            "imagen": "https://i.redd.it/yriap9fnk6u71.jpg",
            "descripcion": "Una vez que fue un heroico Caballero Jedi, Darth Vader fue seducido por el lado oscuro de la Fuerza, se convirtió en un Lord Sith y lideró la erradicación de la Orden Jedi por parte del Imperio. Permaneció al servicio del Emperador, el malvado Darth Sidious, durante décadas, haciendo cumplir la voluntad de su Maestro y tratando de aplastar a la incipiente Alianza Rebelde. Pero todavía había bien en él"
        },
        {
            "id": 19,
            "nombre": "Rey",
            "especie": "Humano",
            "genero": "Femenino",
            "altura": "1.7 m",
            "nacimiento": "35 DBY",
            "planeta": "https://my-json-server.typicode.com/DiabloJM/myStarWarsAPI/planetas/3",
            "imagen": "https://static.wikia.nocookie.net/esstarwars/images/2/2b/Rey_TROS_Fathead.png/revision/latest/scale-to-width-down/326?cb=20191018183720",
            "descripcion": "Una mujer humana sensible a la Fuerza, fue una Jedi que luchó por la Resistencia contra la Primera Orden durante la Era de la Nueva República. Aunque nació como Rey Palpatine, no era consciente de su linaje como nieta del Emperador Sheev Palpatine y se refirió a sí misma simplemente como Rey, creyendo que no era nadie. Endurecida por los duros desiertos de Jakku, Rey aprendió a sobrevivir como carroñera, convirtiéndose en una hábil mecánica, piloto y combatiente en el proceso. Después de descubrir su conexión latente con la Fuerza, Rey se esforzó por aprender el camino de los Jedi mientras intentaba entender su vínculo con el Líder Supremo Kylo Ren"
        },
        {
            "id": 20,
            "nombre": "Finn",
            "especie": "Humano",
            "genero": "Masculino",
            "altura": "1.78 m",
            "nacimiento": "11 DBY",
            "planeta": "DESCONOCIDO",
            "imagen": "https://static.wikia.nocookie.net/esstarwars/images/9/92/Finn_Advanced_Graphics_TROS.png/revision/latest?cb=20200105031349",
            "descripcion": "Finn fue el apodo de FN-2187, un soldado de asalto humano sensible a la Fuerza que sirvió a la Primera Orden hasta su huida y posterior deserción a la Resistencia durante la Guerra Primera Orden-Resistencia. Aunque entrenado desde el nacimiento para ser un soldado leal y obediente, la conciencia de FN-2187 entró en conflicto con los métodos de la Primera Orden. Durante un tiempo no estuvo dispuesto a apoyar a la Resistencia, con la esperanza de escapar del conflicto galáctico en lugar de luchar por una causa que creía estaba condenada al fracaso. A medida que la galaxia se consumía por la guerra, el soldado renegado se vio finalmente obligado a decidir dónde estaban sus verdaderas lealtades"
        },
        {
            "id": 21,
            "nombre": "Kylo Ren",
            "especie": "Humano",
            "genero": "Masculino",
            "altura": "1.89 m",
            "nacimiento": "5 DBY",
            "planeta": "DESCONOCIDO",
            "imagen": "https://i0.wp.com/wipy.tv/wp-content/uploads/2020/02/Significado-del-casco-de-Kylo-Ren.jpg?fit=1000%2C600&ssl=1",
            "descripcion": "Fue un hombre humano sensible a la Fuerza que, siendo maestro de los Caballeros de Ren, conquistó gran parte de la galaxia durante su reinado como Líder Supremo de la Primera Orden. La Fuerza era intensa en Ren; además de su entrenamiento Jedi y su conocimiento del saber arcano del lado oscuro, el linaje de los Jedi y Sith más poderosos fluía por sus venas. Fue la encarnación del conflicto debido a su inmersión en las enseñanzas de ambos lados, pero fue a través de la discordia que obtuvo el poder, canalizando la ira en poder. Finalmente, Ren estaba decidido a extinguir el lado luminoso dentro de sí mismo y destruir los últimos rastros de la Orden Jedi, cumpliendo el legado de su abuelo, el Lord Sith Darth Vader"
        },
        {
            "id": 22,
            "nombre": "Snoke",
            "especie": "Artificial",
            "genero": "Masculino",
            "altura": "2.18 m",
            "nacimiento": "4 DBY",
            "planeta": "DESCONOCIDO",
            "imagen": "https://static.wikia.nocookie.net/esstarwars/images/9/9d/SnokeTLJ.png/revision/latest/scale-to-width-down/350?cb=20180113005803",
            "descripcion": "Fue una creación genética humanoide que gobernó la Primera Orden como Líder Supremo durante la Era de la Nueva República. Posiblemente inconsciente de su verdadera naturaleza, Snoke era una invención genética artificial creada en el planeta Exegol por el resucitado Señor Oscuro de los Sith y Emperador Galáctico Darth Sidious. Aunque fue diseñado para ser un conducto que el Lord Sith pudiera manipular, Snoke poseía una mente independiente y una conexión profunda con el lado oscuro de la Fuerza, sin embargo, no era un Sith. Tenía un profundo conocimiento de la tradición arcana y redescubrió muchos de los secretos perdidos sobre la Fuerza dentro de las Regiones Desconocidas, mientras derrotaba a innumerables adversarios con su astuta manipulación y dominio de la Fuerza"
        },
        {
            "id": 23,
            "nombre": "Wilhuff Tarkin",
            "especie": "Humano",
            "genero": "Masculino",
            "altura": "1.8 m",
            "nacimiento": "64-59 ABY",
            "planeta": "DESCONOCIDO",
            "imagen": "https://static.wikia.nocookie.net/esstarwars/images/c/c1/Tarkininfobox.jpg/revision/latest/top-crop/width/360/height/450?cb=20160918123818",
            "descripcion": "Fue un humano que llegó a ser de los más importantes oficiales del Imperio Galáctico, uno de los primeros en obtener el alto rango de Gran Moff. Fue el creador de la doctrina Tarkin, la cual tuvo su encarnación clave en la Estrella de la Muerte. Era nativo del planeta Eriadu, donde la familia Tarkin tenía una larga historia política. Tarkin inició su carrera sirviendo en la fuerza de seguridad de la República de las regiones exteriores. Después se retiró y entró en la política, iniciando como Gobernador Teniente de Eriadu y el Sector Seswenna. Después de esto volvió a la milicia bajo las órdenes del Canciller Supremo Palpatine, ganando poder hasta llegar a ser gobernador de macrosectores bajo el título de Gran Moff. Durante este tiempo, Tarkin conoció los diseños de su amigo Raith Sienar de una estación de batalla planetaria y expedicionaria. Convencido del potencial del diseño, Tarkin le presentó los diseños a Palpatine, diseños de una estación que más tarde se convertiría en la temible Primera Estrella de la Muerte"
        },
        {
            "id": 24,
            "nombre": "Poe Dameron",
            "especie": "Humano",
            "genero": "Masculino",
            "altura": "1.72 m",
            "nacimiento": "2 DBY",
            "planeta": "https://my-json-server.typicode.com/DiabloJM/myStarWarsAPI/planetas/7",
            "imagen": "https://static.wikia.nocookie.net/esstarwars/images/8/8a/Poe_Dameron_Advanced_Graphics_TROS.png/revision/latest?cb=20200105031746",
            "descripcion": "Fue un piloto humano que sirvió como comandante en la Nueva República y, más tarde, la Resistencia durante su conflicto con la Primera Orden. Hijo de la Teniente Shara Bey y del Sargento Kes Dameron de la Alianza para Restaurar la República, Dameron siguió los pasos de su madre y se convirtió en piloto al servicio de la Flota de Defensa de la Nueva República como comandante del Escuadrón Estoque, pero se desilusionó con la inacción de la República frente a las violaciones del Concordato Galáctico por parte de la Primera Orden. Dameron desertó a la Resistencia, donde se convirtió en uno de los operativos más confiables de la General Leia Organa. Dameron voló bajo el indicativo de Líder Negro mientras pilotaba su caza estelar T-70 Ala-X especializado, Negro Uno"
        }
        ]
      ]
    ],
  ],
  "planetas": [
    [
      "info": {
        "cantidad": 16,
        "paginas": 2,
        "siguiente": "https://my-json-server.typicode.com/DiabloJM/myStarWarsAPI/planeta?pagina=2",
        "prev": null
      },
    "resultados": [
      {
        "id": 1,
        "nombre": "Polis Massa",
        "coordenadas": "K-20",
        "rotacion": "Es un campo de asteroides",
        "orbita": "Es un campo de asteroides",
        "clima": "Anteriormente arido, ahora ninguno",
        "imagen": "https://static.wikia.nocookie.net/esstarwars/images/d/d2/Polis_Massa_surface.jpg/revision/latest/scale-to-width-down/350?cb=20181109014358",
        "descripcion": "Era un campo de asteroides ubicado en el sector Subterrel de los Territorios del Borde Exterior de la galaxia, lejos de las principales rutas hiperespaciales. En algún momento, Polis Massa fue un planeta ubicado dentro del sistema del mismo nombre. El planeta fue el hogar de un pueblo subterráneo llamado eellayin hasta que fue destruido por un misterioso cataclismo",
        "nativos": {
          "https://my-json-server.typicode.com/DiabloJM/myStarWarsAPI/personajes/1",
          "https://my-json-server.typicode.com/DiabloJM/myStarWarsAPI/personajes/2"
        }
      },
      {
        "id": 2,
        "nombre": "Corellia",
        "coordenadas": "M-11",
        "rotacion": "DESCONOCIDO",
        "orbita": "DESCONOCIDO",
        "clima": "Temperado",
        "imagen": "https://static.wikia.nocookie.net/esstarwars/images/d/d7/Corellia-SWCT.png/revision/latest/scale-to-width-down/350?cb=20190128020739",
        "descripcion": "Corellia era un planeta ubicado en los Mundos del Núcleo de la galaxia, conocido por sus pilotos y sus grandes naves estelares. Naves como el Halcón Milenario y las naves Imperiales se construyeron en Corellia",
        "nativos": {
          "https://my-json-server.typicode.com/DiabloJM/myStarWarsAPI/personajes/3"
        }
      },
      {
        "id": 3,
        "nombre": "Jakku",
        "coordenadas": "I-13",
        "rotacion": "26.8 Horas",
        "orbita": "352 Dias",
        "clima": "Fria",
        "imagen": "https://static.wikia.nocookie.net/esstarwars/images/f/ff/Jakku-PoeDameronFlightLog.png/revision/latest/scale-to-width-down/350?cb=20170805083652",
        "descripcion": "Jakku era un remoto planeta desierto ubicado en el sistema del mismo nombre, dentro de las Extensiones Occidentales del Borde Interior de la galaxia. Aunque muchos en la galaxia lo consideraban distante y sin algún valor, Jakku fue el lugar de importantes sucesos que darían forma a la historia galáctica. En el 5 DBY, fue el sitio de la decisiva Batalla de Jakku, la cual puso fin a la Guerra Civil Galáctica en favor de la Nueva República. Una generación más tarde, el planeta fue hogar de la carroñera Rey, quien se involucró en los acontecimientos de la Guerra Fría después de ayudar al antiguo soldado de asalto de la Primera Orden Finn y al droide astromecánico BB-8 a escapar del mundo con un mapa que conducía al desaparecido Jedi Luke Skywalker",
        "nativos": {
          "https://my-json-server.typicode.com/DiabloJM/myStarWarsAPI/personajes/19"
        }
      },
      {
        "id": 4,
        "nombre": "Kashyyyk",
        "coordenadas": "DESCONOCIDO",
        "rotacion": "DESCONOCIDO",
        "orbita": "DESCONOCIDO",
        "clima": "Temperado",
        "imagen": "https://static.wikia.nocookie.net/esstarwars/images/8/8a/Kashyyk_Ghost_Raid.png/revision/latest/scale-to-width-down/350?cb=20160914094510",
        "descripcion": "Kashyyyk fue un planeta cubierto de árboles wroshyr localizado en el cuadrante occidental de la Galaxia y el mundo natal de los wookiees. Era miembro de la República Galáctica y tras las Guerras Clon fue esclavizado por el Imperio Galáctico. El planeta estaba clasificado por el Imperio como G5-623",
        "nativos": {
          "https://my-json-server.typicode.com/DiabloJM/myStarWarsAPI/personajes/4"
        }
      },
      {
        "id": 5,
        "nombre": "Kamino",
        "coordenadas": "DESCONOCIDO",
        "rotacion": "27 Horas",
        "orbita": "463 Dias",
        "clima": "DESCONOCIDO",
        "imagen": "https://static.wikia.nocookie.net/esstarwars/images/5/52/Kamino-DB.png/revision/latest/scale-to-width-down/350?cb=20160913200828",
        "descripcion": "Kamino era un planeta acuático ubicado en un sistema estelar extragaláctico que se encontraba al sur de la galaxia satélite Laberinto Rishi y más allá de la galaxia conocida. Estaba habitado por los kaminoanos, una raza de seres altos y esbeltos que eran considerados como una especie misteriosa con tendencia al hermetismo. También eran conocidos por su tecnología de clonación que finalmente condujo a la creación de un ejército clon para la República Galáctica",
        "nativos": {
          "https://my-json-server.typicode.com/DiabloJM/myStarWarsAPI/personajes/16",
          "https://my-json-server.typicode.com/DiabloJM/myStarWarsAPI/personajes/17"
        }
      },
      {
        "id": 6,
        "nombre": "Mustafar",
        "coordenadas": "L-19",
        "rotacion": "DESCONOCIDO",
        "orbita": "412 Dias",
        "clima": "Abrasador",
        "imagen": "https://static.wikia.nocookie.net/esstarwars/images/6/61/Mustafar-TROSGG.png/revision/latest/scale-to-width-down/350?cb=20201111174744",
        "descripcion": "Mustafar era un pequeño planeta volcánico ubicado en el sistema Mustafar, situado entre dos gigantes gaseosos en los Territorios del Borde Exterior que se alió con la Confederación de Sistemas Independientes durante las Guerras Clon y más tarde fue tomado por el Imperio Galáctico después de que la Tecno Unión se nacionalizara al final del conflicto",
        "nativos": {
          "https://my-json-server.typicode.com/DiabloJM/myStarWarsAPI/personajes/18"
        }
      },
      {
        "id": 7,
        "nombre": "Yavin 4",
        "coordenadas": "DESCONOCIDO",
        "rotacion": "DESCONOCIDO",
        "orbita": "4.818 Dias",
        "clima": "Templado",
        "imagen": "https://static.wikia.nocookie.net/esstarwars/images/d/d4/Yavin-4-SWCT.png/revision/latest/scale-to-width-down/350?cb=20170924222729",
        "descripcion": "Yavin 4 fue la cuarta luna en órbita del gigante gaseoso Yavin Prime, cubierta de junglas. En algún momento durante la Guerra Civil Galáctica, albergó la base principal de la Alianza Para Restaurar la República, un grupo de luchadores de la resistencia que se oponían a la tiranía del Imperio Galáctico. Tras una gran batalla que tuvo lugar alrededor de Yavin, la Alianza trasladó su base a Hoth",
        "nativos": {
          "https://my-json-server.typicode.com/DiabloJM/myStarWarsAPI/personajes/24"
        }
      },
      {
        "id": 8,
        "nombre": "Mandalore",
        "coordenadas": "O-7",
        "rotacion": "19 Horas",
        "orbita": "366 Dias",
        "clima": "Calido y Seco",
        "imagen": "https://static.wikia.nocookie.net/esstarwars/images/5/5e/Mandalore_SWCT.png/revision/latest/scale-to-width-down/350?cb=20170913230013",
        "descripcion": "Mandalore fue un planeta ubicado en los Territorios del Borde Exterior. Era el mundo natal de los mandalorianos, un pueblo temible y belicista que luchó contra los Jedi y asaltó su templo durante la caída de la Antigua República. Con una armadura distintiva a menudo hecha de beskar, eran temidos en toda la galaxia y tenían influencia política sobre otros dos mil sistemas estelares",
        "nativos": {
        }
      },
      {
        "id": 9,
        "nombre": "Tatooine",
        "coordenadas": "DESCONOCIDO",
        "rotacion": "DESCONOCIDO",
        "orbita": "DESCONOCIDO",
        "clima": "Arido",
        "imagen": "https://static.wikia.nocookie.net/esstarwars/images/b/b0/Tatooine_TPM.png/revision/latest/scale-to-width-down/350?cb=20131214162357",
        "descripcion": "Tatooine era un planeta desértico circunvolucional escasamente habitado ubicado en los Territorios del Borde Exterior de la galaxia. Servio como el planeta natal de los influyentes Anakin y Luke Skywalker, que le darían forma a la historia galáctica. Parte de un sistema estelar binario, el planeta era oprimido por los soles abrasadores, lo que provocó que el mundo careciera de las aguas superficiales necesarias para sostener grandes poblaciones. Como resultado, muchos residentes del planeta sacaron agua de la atmósfera a través de granjas de humedad",
        "nativos": {
          "https://my-json-server.typicode.com/DiabloJM/myStarWarsAPI/personajes/11",
          "https://my-json-server.typicode.com/DiabloJM/myStarWarsAPI/personajes/7"
        }
      },
      {
        "id": 10,
        "nombre": "Naboo",
        "coordenadas": "O-17",
        "rotacion": "26 Horas",
        "orbita": "312 Dias",
        "clima": "Templado",
        "imagen": "https://static.wikia.nocookie.net/esstarwars/images/f/f0/Naboo_planet.png/revision/latest/scale-to-width-down/350?cb=20190928214307",
        "descripcion": "Naboo era un pequeño mundo pastoral[37] en el Borde Medio,[1] ubicado cerca de la frontera de los Territorios del Borde Exterior.[9] A diferencia de la mayoría de los otros mundos, el antiguo planeta carecía de un núcleo fundido, y en su lugar comprendía un conglomerado de cuerpos grandes y rocosos que formaban una red de túneles y cuevas inundadas. Los nativos gungans, que construyeron sus hogares en las aguas de Naboo, rara vez se aventuraban en el núcleo, temiendo a las voraces bestias marinas que residían[1] en áreas como las Cuevas de Eleuabad",
        "nativos": {
          "https://my-json-server.typicode.com/DiabloJM/myStarWarsAPI/personajes/6",
          "https://my-json-server.typicode.com/DiabloJM/myStarWarsAPI/personajes/12",
          "https://my-json-server.typicode.com/DiabloJM/myStarWarsAPI/personajes/15"
        }
      },
      {
        "id": 11,
        "nombre": "Coruscant",
        "coordenadas": "L-9",
        "rotacion": "24 Horas",
        "orbita": "365 Dias",
        "clima": "Templado",
        "imagen": "https://static.wikia.nocookie.net/esstarwars/images/8/84/CoruscantGlobeE1.png/revision/latest?cb=20190503173154",
        "descripcion": "Coruscant, también conocido como Centro Imperial durante el reinado del Imperio Galáctico, fue una ecumenópolis —un planeta cubierto de ciudad, colectivamente conocida como Ciudad Galáctica— en el sistema Coruscant de los Mundos del Núcleo. Aunque era asunto de debate entre los historiadores, en general se creía que Coruscant era el planeta natal original de la humanidad. Destacado por su cultura cosmopolita y sus enormes rascacielos, la población de Coruscant consistía en aproximadamente un billón de ciudadanos pertenecientes a un amplio abanico de especies humanoides y alienígenas. Además, la ubicación estratégica de Coruscant al final de varias grandes rutas hiperespaciales permitió que creciera en poder e influencia, haciendo que el planeta-ciudad superara a sus rivales iniciales y se convirtiera en un núcleo galáctico de cultura, educación, finanzas, artes, política y tecnología. Albergaba varios puntos de gran interés, incluido el Templo Jedi, la Plaza de los Monumentos y el Edificio del Senado Galáctico",
        "nativos": {
        }
      },
      {
        "id": 12,
        "nombre": "Alderaan",
        "coordenadas": "1942.44, -89.52",
        "rotacion": "24 Horas",
        "orbita": "365 Dias",
        "clima": "Montañoso",
        "imagen": "https://static.wikia.nocookie.net/esstarwars/images/4/4a/Alderaan.jpg/revision/latest/scale-to-width-down/350?cb=20100723184830",
        "descripcion": "Después del surgimiento del Imperio Galáctico de Sheev Palpatine, Alderaan desempeñó un papel fundamental en el establecimiento de la Alianza Rebelde, un movimiento que buscaba restaurar los valores de la Antigua República. Debido a sus lazos con la Alianza, el planeta fue destruido cuando el Gran Moff Wilhuff Tarkin decidió probar el superláser de la Estrella de la Muerte, una estación de batalla de tamaño lunar desarrollada por el Imperio, con toda su fuerza. Entre los pocos sobrevivientes de ese desastre estaba la princesa Leia Organa, hija adoptiva de Bail y Breha Organa y heredera de la casa real de Alderaan",
        "nativos": {
        }
      },
    ],
    [
      "info": {
        "cantidad": 16,
        "paginas": 2,
        "siguiente": null,
        "prev": "https://my-json-server.typicode.com/DiabloJM/myStarWarsAPI/planeta?pagina=1",
      },
      "resultados": [
      {
        "id": 13,
        "nombre": "Ahch-To",
        "coordenadas": "DESCONOCIDO",
        "rotacion": "DESCONOCIDO",
        "orbita": "DESCONOCIDO",
        "clima": "DESCONOCIDO",
        "imagen": "https://static.wikia.nocookie.net/esstarwars/images/0/04/Ahch-To_TLJTVD.png/revision/latest/scale-to-width-down/350?cb=20190604002222",
        "descripcion": "Ahch-To era un planeta principalmente cubierto de agua, con numerosas islas rocosas cubiertas de árboles verdes ubicados en las Regiones Desconocidas. Fue el lugar de nacimiento de la Orden Jedi y albergaba los antiguos textos Jedi. Tres décadas después de la Guerra Civil Galáctica, sirvió como hogar del Maestro Jedi Luke Skywalker, quien se exilió en busca del primer Templo Jedi después de que Kylo Ren destruyera su templo y a sus estudiantes Jedi. Luego de que la Resistencia juntara dos fragmentos de un mapa para revelar la ubicación de Skywalker, Rey viajó a Ahch-To en el Halcón Milenario acompañada por R2-D2 y Chewbacca, en su búsqueda",
        "nativos": {
        }
      },
      {
        "id": 14,
        "nombre": "Geonosis",
        "coordenadas": "DESCONOCIDO",
        "rotacion": "DESCONOCIDO",
        "orbita": "DESCONOCIDO",
        "clima": "Arido",
        "imagen": "https://static.wikia.nocookie.net/esstarwars/images/6/6d/Geonosis_AotC.png/revision/latest/scale-to-width-down/350?cb=20161025214407",
        "descripcion": "Geonosis, llamado Geonosia por algunos nativos, fue el mundo natal de los geonosianos. Un planeta desértico e inhóspito, Geonosis fue la primera capital de la Confederación de Sistemas Independientes, albergando sus principales fundiciones de droides. Fue el lugar en el que tuvo lugar la Primera Batalla de Geonosis, la primera batalla del conflicto conocido como las Guerras Clon. Después de la batalla, Geonosis fue invadido por la República Galáctica",
        "nativos": {
        }
      },
      {
        "id": 15,
        "nombre": "Dagobah",
        "coordenadas": "DESCONOCIDO",
        "rotacion": "DESCONOCIDO",
        "orbita": "DESCONOCIDO",
        "clima": "Periodos de lluvias torrenciales",
        "imagen": "https://static.wikia.nocookie.net/esstarwars/images/1/1c/Dagobah.jpg/revision/latest/scale-to-width-down/350?cb=20061117132132",
        "descripcion": "Dagobah era un planeta en el sistema Dagobah, y uno de los lugares más puros de la galaxia dentro de la Fuerza. Un mundo lejano lleno de pantanos y bosques, sirvió como refugio para el Gran Maestro Jedi Yoda durante su exilio tras la destrucción de la Orden Jedi. Fue allí donde Luke Skywalker recibió un entrenamiento avanzado en los caminos de la Fuerza bajo la tutela del Maestro Jedi Yoda y más tarde sería testigo de su muerte y transformación en la Fuerza",
        "nativos": {
        }
      },
      {
        "id": 16,
        "nombre": "Hoth",
        "coordenadas": "K-18",
        "rotacion": "23 Horas",
        "orbita": "549 Dias",
        "clima": "Frio",
        "imagen": "https://static.wikia.nocookie.net/esstarwars/images/1/1d/Hoth_SWCT.png/revision/latest/scale-to-width-down/350?cb=20170802030704",
        "descripcion": "Hoth era un helado y remoto planeta que fue el sexto planeta del sistema estelar del mismo nombre. En particular, albergó la Base Eco, sede temporal de la Alianza para Restaurar la República, hasta que el Imperio Galáctico localizó a los rebeldes, iniciando una gran confrontación conocida como la Batalla de Hoth",
        "nativos": {
        }
      }
    ]
    ]
    ],
  ]
}
